<토독(Todok) 사용 설명서>

■Home 페이지
[Day task]
-Day task는 터치로 수정 가능하며, 오른쪽 스와이프 시 삭제할 수 있습니다.
-리스트 좌측에는 체크박스가 있고, 체크 시 하단으로 이동하여 완료 상태가 됩니다.
-완료된 task는 롤오버 시각이 되면 사라지게 됩니다.    ※롤오버 시각 : 설정에서 변경 가능, 기본값은 자정
-"매일 할 일" 토글을 활성화하면 일일 task 좌측에 핀 표시가 생깁니다.
-핀 표시가 생긴 Day task는 한 번 완료되어 삭제되더라도 매일 refill 됩니다.

[요일별 할 일 리스트]
-Week 페이지에서 설정한 요일이 되면, 머스타드색 Week task가 리스트에 생깁니다.
-Day task와 마찬가지로, 체크박스로 완료 상태로 만들 수 있고 오른쪽 스와이프로 삭제할 수 있습니다. 
-다만 리스트에서 삭제되어도 Week 페이지에서 설정을 바꾸지 않는 이상, 해당 요일이 되면 다시 task가 생기게 됩니다.

[알림 배너]
-Calnd. 페이지에서 설정한 날짜가 되면, Home 페이지 최상단에 해당 내용을 알려주는 배너가 생성됩니다.
-배너는 완료 상태로 만들거나 스와이프하여 삭제할 수 없고, 롤오버되면 사라집니다.

■Week 페이지
-요일별 task를 설정할 수 있습니다.

■Calnd. 페이지
-달력에서 날짜를 선택한 뒤 할 일을 작성하여 등록 버튼을 누르면, 해당 날짜가 되었을 때 Home 페이지 최상단에 알림 배너로 나타납니다.
-할 일이 작성된 날짜 밑에는 동그라미가 생성되며, 해당 날짜를 달력에서 클릭하면 하단에 할 일 목록이 나타납니다.
-생성된 task를 클릭하면, 수정 가능한 편집모드로 들어가게되며, 우측에 x표시가 생겨 삭제 가능해집니다.

■Memo 페이지
-스티커 메모를 붙일 수 있습니다. 클릭하여 편집모드로 들어가게 되면 내용을 수정하거나 메모 크기를 조절할 수 있습니다.
-사진 메모는 기기에 저장되어 있는 jpg, png 등 파일의 바로가기라고 생각하면 됩니다. 원본 파일이 사라지거나 위치가 변경되면, 사진이 표시되지 않습니다.

■설정 페이지
-롤오버 시각을 설정할 수 있습니다. 해당 시각을 기준으로 날짜/요일이 바뀌는 개념이라고 생각하면 됩니다. 자정 넘어까지 야근을 하게 되는 상황을 염두에 두고 만들었습니다ㅜㅜ
-백업 데이터를 내보냈다가 불러올 수 있습니다.
